In [1]:
import numpy as np
import pandas as pd

In [58]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,777,444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})

In [59]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [7]:
#finding unique values in a Data Frame

In [8]:
df['col2'].unique() #will return a numpy array of all unique values

array([444, 555, 777], dtype=int64)

In [9]:
len(df['col2'].unique()) #to know how many unique numbers

3

In [10]:
df['col2'].nunique() #to know how many unique numbers using pandas

3

In [11]:
#returns how many times a unique value is referred in that column
df['col2'].value_counts()

444    2
555    1
777    1
Name: col2, dtype: int64

In [12]:
#SELECTING DATA

In [14]:
#return all the rows where the DataFrame in
#column 1 is higher than 2
df[df['col1']>2]

   col1  col2 col3
2     3   777  ghi
3     4   444  xyz

In [15]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [16]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [19]:
#creating a funcion
def times2(x):
    return x*2

In [18]:
df['col1'].sum()

10

In [21]:
#applying my own function inside the column of df
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
#to know the len of the strings in column 3
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [26]:
#apply is specially powerful to be applied with lambda expressions
#creating a function with lambda that multiplies the values of
#column 2 by 2
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1554
3     888
Name: col2, dtype: int64

In [27]:
#MOVING COLUMNS

In [28]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [29]:
df.drop('col1', axis=1) #axis 1 to remove a column, axis 0 to remove a row

   col2 col3
0   444  abc
1   555  def
2   777  ghi
3   444  xyz

In [30]:
df #did not remove definitely

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [31]:
#use inplace=True to remove for good
df.drop('col1', axis = 1, inplace=True)

In [32]:
df

   col2 col3
0   444  abc
1   555  def
2   777  ghi
3   444  xyz

In [38]:
#adding the column again
col1 = [1,2,3,4]

In [39]:
df['col1'] = col1 #adding the column again

In [40]:
df

   col2 col3  col1
0   444  abc     1
1   555  def     2
2   777  ghi     3
3   444  xyz     4

In [43]:
#reordering columns as desired
df = df[['col1', 'col2', 'col3']]

In [45]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [46]:
df.columns #gives information in the columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [47]:
df.index #gives information in the index

RangeIndex(start=0, stop=4, step=1)

In [48]:
#SORTING AND ORDERING A DATAFRAME

In [50]:
#To sort the datafram by column 2
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   777  ghi

In [51]:
df.sort_values(by='col2') 
#As by is the FIRST argument, I don't need
#to write it down, it is optional

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   777  ghi

In [53]:
#return if we have null values in our DataFrame

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [54]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [61]:
#filling in nan values with something else

In [62]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [63]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [64]:
#create a multiindex for the DataFrame
#PIVOT TABLE
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [65]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [66]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN